{
  "1733b1f162decdd2d371ec5aefd41eb1": {
    "origin": "![](qworld/images/readme-logo.jpg)\n\n\n\n",
    "translate": "![](qworld/images/readme-logo.jpg)\n\n\n\n"
  },
  "bc882d085695c0473952182bc207ca23": {
    "origin": "![](qworld/images/readme-logo.jpg)\n\n\n\n",
    "translate": "![](qworld/images/readme-logo.jpg)\n\n\n\n"
  },
  "b4943e2ec831ebc2620664ac4e10efec": {
    "origin": "## [QWorld](https://qworld.net)'s Bronze-Qiskit\n\n\n\n**Bronze** is our introductory tutorial on _**quantum computing and quantum programming**_ created in October 2018.\n\n\n\n**Bronze-Qiskit** is the version of Bronze using [**Qiskit**](https://qiskit.org) as the quantum programming framework. It was released in February 2021 with the support of [**IBM Quantum**](https://www.ibm.com/quantum-computing/).\n\n\n\nBronze is a collection of Jupyter notebooks, and each notebook has many programming tasks to provide hands-on experiences. We see Bronze as a laboratory where you can learn the basics of quantum computing and quantum programming by doing. Bronze has already been used in more than 50 workshops ([the most recent list](http://qworld.net/workshop-bronze/#list)) under QWorld. As a pedagogical strategy, we skip to use complex numbers to keep the tutorial simpler. \n\n\n\n",
    "translate": "## [QWorld](https://qworld.net) Bronze-Qiskit\n\n\n\n**Bronze** to nasz wprowadzający samouczek dotyczący _**komputerów kwantowych i programowania kwantowego**_ utworzony w październiku 2018.\n\n\n\n**Bronze-Qiskit** to wersja Bronze wykorzystująca [**Qiskit**](https://qiskit.org) jako framework do programowania kwantowego. Została wydana w lutym 2021 roku przy wsparciu [**IBM Quantum**](https://www.ibm.com/quantum-computing/).\n\n\n\nBronze to zbiór notebooków Jupyter, a każdy z nich zawiera wiele zadań programistycznych, aby zapewnić praktyczne doświadczenia. Widzimy Bronze jako laboratorium, w którym można nauczyć się podstaw komputerów kwantowych i programowania kwantowego poprzez praktykę. Bronze został już wykorzystany w ponad 50 warsztatach ([najnowsza lista](http://qworld.net/workshop-bronze/#list)) organizowanych przez QWorld. Aby ułatwić przyswajanie wiedzy pomijamy całkowicie temat liczb zespolonych w naszych tutorialach.\n\n\n\n"
  },
  "cc9eba90567cc7ecd79c39e0b531ccdb": {
    "origin": "### Prerequisite\n\n\n\nThe only prerequisite is to know the basics of programming (variables and basic data types, loops, and conditionals). Any previous experience in python will be helpful. If you do not have any such experince, you can check our notebooks on python before starting the tutorial.\n\n\n\nBronze also has notebooks on the basic math to review your knowledge on the simple arithmetic operations on vectors and matrices.\n\n\n\n",
    "translate": "### Wymagania wstępne\n\nJedynym wymaganiem jest znajomość podstaw programowania (zmienne i podstawowe typy danych, pętle i warunki). Jakiekolwiek wcześniejsze doświadczenie związane z językiem Python będzie pomocne. Jeśli nie masz takiego doświadczenia, możesz sprawdzić nasze Jupyter notebooki na temat Pythona przed rozpoczęciem samouczka.\n\nPonadto w tym kursie znajdziesz notebooki dotyczące podstawowych zagadnień matematycznych, które pozwolą Ci przypomnieć podstawowe operacje arytmetyczne na wektorach i macierzach.\n\n\n\n"
  },
  "866b3a8a48eafcba3820313fb5532bd3": {
    "origin": "### Bronze-Qiskit's sections\n\n\n\n- Python (for a quick review)\n\n- Basic math (for a quick review)\n\n- Classical systems: bits, coin-flipping, probabilistic state and operators, composite systems, correlation, and controlled operators\n\n- Quantum systems with Qiskit\n\n    - Qiskit basics: circuit design, visualization, and simulation\n\n    - quantum basics: quantum coin-flipping and Hadamard operator, quantum states and opeators, visualization of a real-valued qubit, superposition and measurements\n\n    - quantum operators on a real-valued single qubit (rotations and reflections) and quantum tomography\n\n    - entanglement and basic quantum protocols superdense coding and quantum teleportation\n\n    - Grover's search algorithm\n\n\n\nOur following elementrary level tutorial _Silver_ is under revision now, and we will start to prepare the advanced level tutorial Gold in 2021.\n\n\n\n",
    "translate": "### Sekcje kursu Bronze-Qiskit\n\n\n\n- Python (dla szybkiego przeglądu)\n\n- Podstawowa matematyka (dla szybkiego przeglądu)\n\n- Systemy klasyczne: bity, rzucanie monetą, stan probabilistyczny i operatory, systemy złożone, korelacja oraz operatory kontrolowane\n\n- Systemy kwantowe z użyciem Qiskit\n\n    - Podstawy Qiskit: projektowanie obwodów, wizualizacja i symulacja\n\n    - Podstawy kwantowe: kwantowe rzucanie monetą i operator Hadamarda, stany i operatory kwantowe, wizualizacja kubitów o wartościach rzeczywistych, splątanie i pomiary\n\n    - Operatory kwantowe na kubicie o wartościach rzeczywistych (rotacje i odbicia) oraz tomografia kwantowa\n\n    - Splątanie i podstawowe protokoły kwantowe: supergęste kodowanie i teleportacja kwantowa\n\n    - Algorytm Grovera do wyszukiwania\n\n\n\nNasz następny samouczek na poziomie podstawowym _Silver_ jest obecnie w trakcie rewizji, a w 2021 roku rozpoczniemy przygotowania do zaawansowanego samouczka poziomu Gold.\n\n\n\n"
  },
  "9e15badad862f02e074183c2ec657d3b": {
    "origin": "## Contribution\n\n\n\nPlease make a pull request or create an issue for _reporting typo_ or _your corrections_.\n\n\n\nPlease create an issue for _your questions_, _initiating a discussion_, or _proposing a contribution_.\n\n\n\n_Bronze is being developed under [QEducation departmant](https://qworld.net/qeducation/) of QWorld._\n\n\n\n",
    "translate": "## Współtworzenie\n\nProszę utwórz pull request lub zgłoś problem dotyczący _literówki_ lub _twoich poprawek_.\n\nProszę utwórz nowe zgłoszenie dotyczące _twoich pytań_, _rozpoczęcia dyskusji_ lub _zaproponowania zmiany_.\n\n_Bronze jest rozwijane w ramach [departamentu QEducation](https://qworld.net/qeducation/) w ramach QWorld._\n\n\n\n"
  },
  "0c4a6339e68efec3b6da077e4e28f108": {
    "origin": "## Installation\n\n\n\nFollow the instructions given in the [installation file](installation.pdf)!\n\n\n\n<small>\n\n\n\n**Using Binder:** _You may [launch Bronze in the cloud with binder](https://mybinder.org/v2/gl/qworld%2Fbronze-qiskit/HEAD?urlpath=lab/tree/START.ipynb) but **please be aware of that**_ \n\n- _each time a new session is created, which takes some time to be initiated, and all changes are lost when ending the session; and,_\n\n- _the session might be terminated if a new tab is not opened within 10 minutes._\n\n[![Binder](https://mybinder.org/badge_logo.svg)](https://mybinder.org/v2/gl/qworld%2Fbronze-qiskit/HEAD?urlpath=lab/tree/START.ipynb)\n\n</small>\n\n\n\n",
    "translate": "## Instalacja\n\nPostępuj zgodnie z instrukcjami zawartymi w [pliku instalacyjnym](installation.pdf)!\n\n<small>\n\n**Korzystając z Binder:** _Możesz [uruchomić Bronzę w chmurze za pomocą bindera](https://mybinder.org/v2/gl/qworld%2Fbronze-qiskit/HEAD?urlpath=lab/tree/START.ipynb) ale **proszę miej świadomość, że**_\n\n- _za każdym razem tworzona jest nowa sesja, co zajmuje trochę czasu na inicjowanie, i wszystkie zmiany są tracone po zakończeniu sesji; oraz,_\n\n- _sesja może zostać zakończona, jeśli w ciągu 10 minut nie zostanie otwarta nowa karta._\n\n[![Binder](https://mybinder.org/badge_logo.svg)](https://mybinder.org/v2/gl/qworld%2Fbronze-qiskit/HEAD?urlpath=lab/tree/START.ipynb)\n\n</small>\n\n\n\n"
  },
  "cd0fed20aeb2abea6a9a25fda492f113": {
    "origin": "## License\n\n\n\nThe text and figures are licensed under the Creative Commons Attribution 4.0 International Public License (CC-BY-4.0), available at https://creativecommons.org/licenses/by/4.0/legalcode. \n\n\n\nThe code snippets in the notebooks are licensed under Apache License 2.0, available at http://www.apache.org/licenses/LICENSE-2.0.\n\n\n\n",
    "translate": "## Licencja\n\nTekst i ilustracje są licencjonowane na zasadach Creative Commons Attribution 4.0 International Public License (CC-BY-4.0), dostępne pod adresem https://creativecommons.org/licenses/by/4.0/legalcode.\n\nFragmenty kodu w notebookach są licencjonowane na zasadach licencji Apache License 2.0, dostępnej pod adresem http://www.apache.org/licenses/LICENSE-2.0.\n\n\n\n"
  },
  "fa1a43b78228a249180cd79e1c4e8f12": {
    "origin": "## Acknowledgements\n\n\n\nWe use [MathJax](https://www.mathjax.org) to display mathematical expressions on html files (e.g., exercises).\n\n\n\nWe use open source interactive tool [quantumgame](http://play.quantumgame.io) for showing quantum coin flipping experiments.\n\n\n\n",
    "translate": "## Podziękowania\n\n\n\nDo wyświetlania wyrażeń matematycznych w plikach html (np. ćwiczenia) używamy [MathJax](https://www.mathjax.org).\n\n\n\nDo prezentowania eksperymentów z rzucaniem monetą kwantową korzystamy z interaktywnego narzędzia typu open source [quantumgame](http://play.quantumgame.io).\n\n\n\n"
  },
  "9003940eb3b144023e6e10f038605d8d": {
    "origin": "## Credits\n\n\n\nBronze was created by [Abuzer Yakaryilmaz](http://abu.lu.lv) (QWorld & QLatvia) in October 2018, and it has been developed and maintained by him. \n\n\n\nÖzlem Salehi Köken (QWorld & QTurkey) and Maksims Dimitrijevs (QWorld & QLatvia) are the other contributors by preparing new notebooks and revising the existing notebooks.\n\n\n\nBronze was publicly available on July 7, 2019.\n\n\n\nBronze-Qiskit was released by Abuzer Yakaryilmaz in February 2021.\n\n\n\n",
    "translate": "## Uznania\n\n\n\nBronze został stworzony przez [Abuzera Yakaryilmaza](http://abu.lu.lv) (QWorld & QLatvia) w październiku 2018 roku i od tego czasu był przez niego rozwijany i utrzymywany.\n\n\n\nÖzlem Salehi Köken (QWorld & QTurkey) oraz Maksims Dimitrijevs (QWorld & QLatvia) są innymi współpracownikami, którzy przygotowali nowe notebooki i zrewidowali istniejące.\n\n\n\nBronze został udostępniony publicznie 7 lipca 2019 roku.\n\n\n\nBronze-Qiskit został wydany przez Abuzera Yakaryilmaza w lutym 2021 roku.\n\n\n\n"
  },
  "0e93ee665b7bbbe34eba05f48e1e5141": {
    "origin": "### Video lectures\n\n\n\nThe recording lectures were prepared by Abuzer Yakaryilmaz, Özlem Salehi Köken, and Anastasija Trizna (QLatvia) in August 2020.\n\n\n\n",
    "translate": "### Wykłady wideo\n\n\n\nNagrania wykładów zostały przygotowane przez Abuzera Yakaryilmaza, Özlem Salehi Köken oraz Anastasiję Triznę (QLatvia) w sierpniu 2020 roku.\n\n\n\n"
  },
  "fe335d3f354957eccff6a5bb52967d6b": {
    "origin": "### Bronze-Qiskit 2021\n\n\n\nAgnieszka Wolska prepared the new graphics and logos.\n\n\n\n",
    "translate": "### Bronze-Qiskit 2021\n\n\n\nAgnieszka Wolska przygotowała nową grafikę i loga.\n\n\n\n"
  },
  "49873de5ef2def66d0e042abb5ae1360": {
    "origin": "### Bronze 2020 & 2021\n\n\n\nWe thank to the participants of QBronze workshops and [QTraining for Bronze program](https://qworld.net/qtraining-for-bronze-2020/) for their corrections and suggestions.\n\n\n\n",
    "translate": "### Brąz 2020 i 2021\n\n\n\nDziękujemy uczestnikom warsztatów QBronze oraz [programowi QTraining for Bronze](https://qworld.net/qtraining-for-bronze-2020/) za ich poprawki i sugestie.\n\n\n\n"
  },
  "a3b3642a48dc2444778a5b4530d74b29": {
    "origin": "### Bronze 2019\n\n\n\nWe thank to the mentors and participants of [QDrive](https://qworld.net/qdrive/) for their very helpful corrections and suggestions.\n\n\n\nWe thank Adam Glos (QWorld & QPoland) for his comments on Bronze 2018.\n\n\n\n",
    "translate": "### Brązowy 2019\n\n\n\nDziękujemy mentorom i uczestnikom [QDrive](https://qworld.net/qdrive/) za bardzo pomocne poprawki i sugestie.\n\n\n\nDziękujemy Adamowi Glosowi (QWorld & QPoland) za komentarze dotyczące Bronze 2018.\n\n\n\n"
  },
  "cc76339f1610b77f9165d6793574a2d4": {
    "origin": "### Bronze 2018\n\n\n\nWe thank to Katrina Kizenbaha from Riga TechGirls for her revisions on our notebooks on python.\n\n\n\nWe thank to Martins Kalis (QLatvia) for his technical comments on python, qiskit, and our notebooks.\n\n\n\nWe thank to Maksims Dimitrijevs (QLatvia) for his careful reading and corrections on our notebooks.\n\n\n\nWe thank to QLatvia's first members Martins Kalis, Maksims Dimitrijevs, Aleksejs Naumovs, Andis Draguns, and Matiss Apinis for their help and support.\n\n\n\nWe thank to the students of [Faculty of Computing](https://www.df.lu.lv) (University of Latvia) attending quantum programming's meetings on each Friday (Fall 2018) for their comments while working with our notebooks.\n",
    "translate": "### Bronze 2018\n\nDziękujemy Katrinie Kizenbahie z Riga TechGirls za jej poprawki w naszych notebookach na temat języka Python.\n\nDziękujemy Martinowi Kalisowi (QLatvia) za jego komentarze techniczne dotyczące Pythona, qiskit oraz naszych notebooków.\n\nDziękujemy Maksimowi Dimitrijewowi (QLatvia) za staranne przeczytanie i poprawienie naszych notebooków.\n\nDziękujemy pierwszym członkom QLatvia - Martinowi Kalisowi, Maksimowi Dimitrijewowi, Aleksejsowi Naumovsowi, Andisowi Dragunsowi oraz Matissowi Apinisowi za ich pomoc i wsparcie.\n\nDziękujemy studentom [Wydziału Informatyki](https://www.df.lu.lv) (Uniwersytet Łotwy), którzy uczestniczyli w spotkaniach z programowaniem kwantowym każdego piątku (jesień 2018) za ich komentarze podczas pracy z naszymi notebookami.\n"
  }
}